package com.luguosong._20_variables;

/**
 * 原码、反码、补码
 *
 * @author luguosong
 * @date 2022/9/15
 */
public class BinaryDemo {
    public static void main(String[] args) {
        //源码：10000000 00000000 00000000 00000101
        //反码：11111111 11111111 11111111 11111010
        //补码：11111111 11111111 11111111 11111011
        System.out.println(Integer.toBinaryString(-5));
        //源码：10000000 00000000 00000000 00000100
        //反码：11111111 11111111 11111111 11111011
        //补码：11111111 11111111 11111111 11111100
        System.out.println(Integer.toBinaryString(-4));
        //源码：10000000 00000000 00000000 00000011
        //反码：11111111 11111111 11111111 11111100
        //补码：11111111 11111111 11111111 11111101
        System.out.println(Integer.toBinaryString(-3));
        //源码：10000000 00000000 00000000 00000010
        //反码：11111111 11111111 11111111 11111101
        //补码：11111111 11111111 11111111 11111110
        System.out.println(Integer.toBinaryString(-2));
        //源码：10000000 00000000 00000000 00000001
        //反码：11111111 11111111 11111111 11111110
        //补码：11111111 11111111 11111111 11111111
        System.out.println(Integer.toBinaryString(-1));
        //源码：00000000 00000000 00000000 00000000
        //反码：00000000 00000000 00000000 00000000
        //补码：00000000 00000000 00000000 00000000
        System.out.println(Integer.toBinaryString(0));
        //源码：00000000 00000000 00000000 00000001
        //反码：00000000 00000000 00000000 00000001
        //补码：00000000 00000000 00000000 00000001
        System.out.println(Integer.toBinaryString(1));
        //源码：00000000 00000000 00000000 00000010
        //反码：00000000 00000000 00000000 00000010
        //补码：00000000 00000000 00000000 00000010
        System.out.println(Integer.toBinaryString(2));
        //源码：00000000 00000000 00000000 00000011
        //反码：00000000 00000000 00000000 00000011
        //补码：00000000 00000000 00000000 00000011
        System.out.println(Integer.toBinaryString(3));
        //源码：00000000 00000000 00000000 00000100
        //反码：00000000 00000000 00000000 00000100
        //补码：00000000 00000000 00000000 00000100
        System.out.println(Integer.toBinaryString(4));
        //源码：00000000 00000000 00000000 00000101
        //反码：00000000 00000000 00000000 00000101
        //补码：00000000 00000000 00000000 00000101
        System.out.println(Integer.toBinaryString(5));
    }
}
